B3/blog/app/controllers/back_controller.rb

SELECT  "admins".* FROM "admins" WHERE "admins"."adminname" = ? LIMIT ?  [["adminname", "alex"], ["LIMIT", 1]]
INSERT INTO "admins" ("adminname", "password", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["adminname", "alex"], ["password", "123"], ["created_at", "2018-08-21 04:52:22.752712"], ["updated_at", "2018-08-21 04:52:22.752712"]]
---
  def register_result
    @return
    if params[:key] == 'secret'
      if Admin.find_by_adminname(params[:adminname])
        @return = '对不起，该用户已经存在'
      else
        @new_admin = Admin.new(adminname: params[:adminname], password: params[:password1])
        @new_admin.save

SELECT  "admins".* FROM "admins" WHERE "admins"."adminname" = ? LIMIT ?  [["adminname", "alex"], ["LIMIT", 1]]
---
  def login_result
    @return
    session[:adminname]
    session[:username] = 'admin'
    @admin = Admin.find_by_adminname(params[:adminname])

SELECT "posts".* FROM "posts" WHERE "posts"."pass" = ?  [["pass", "-"]]
---
  def articles_admin
    @articles = Post.where(pass: '-')

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 10], ["LIMIT", 1]]
UPDATE "posts" SET "pass" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["pass", "T"], ["updated_at", "2018-08-21 05:49:41.198207"], ["id", 10]]
---
  def pass
    @article = Post.find(params[:id])
    @article.update(pass: 'T')

SELECT "comments".* FROM "comments"
---
  def comments_admin
    @comments = Comment.all

SELECT "feedbacks".* FROM "feedbacks"
---
  def feedbacks_admin
    @feedbacks = Feedback.all