B3/blog/app/controllers/front_controller.rb

  def register_result
    @return
    if User.find_by_username(params[:username])
      @return = '对不起，该用户已经存在'
    else
      @new_user = User.new(username: params[:username], password: params[:password1])
      @new_user.save
---
SELECT  "users".* FROM "users" WHERE "users"."username" = ? LIMIT ?  [["username", "asd"], ["LIMIT", 1]]
INSERT INTO "users" ("username", "password", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["username", "qqq"], ["password", "123"], ["created_at", "2018-08-15 08:42:33.184289"], ["updated_at", "2018-08-15 08:42:33.184289"]]

  def login_result
    @return
    session[:username]
    session[:adminname] = nil
    @user = User.find_by_username(params[:username])
---
SELECT  "users".* FROM "users" WHERE "users"."username" = ? LIMIT ?  [["username", "sss"], ["LIMIT", 1]]

  def home
    # @articles = Post.find_by_sql("select * from posts where pass='T' order by id desc")
    @articles = Post.where(pass: 'T')
---
SELECT "posts".* FROM "posts" WHERE "posts"."pass" = ?  [["pass", "T"]]

  def write_article_result
    @new_article = Post.new(title: params[:title2], content: params[:content], kinds: params[:kinds], author: session[:username], pass: '-')
    @new_article.save
---
INSERT INTO "posts" ("title", "content", "kinds", "author", "pass", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["title", "ces"], ["content", "ces"], ["kinds", "科技"], ["author", "alex"], ["pass", "-"], ["created_at", "2018-08-21 06:15:14.507323"], ["updated_at", "2018-08-21 06:15:14.507323"]]

  def search_article_result
    @articles
    @articles = if params[:author].empty? # 说明是按分类查询
                  Post.where(kinds: params[:kinds])
                else
                  Post.where(author: params[:author])
---
SELECT "posts".* FROM "posts" WHERE "posts"."kinds" = ?  [["kinds", "科技"]]
SELECT "posts".* FROM "posts" WHERE "posts"."author" = ?  [["author", "asd"]]

  def write_feedback_result
    @new_feedback = Feedback.new(content: params[:content], author: session[:username])
    @new_feedback.save
---
INSERT INTO "feedbacks" ("content", "author", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["content", "123"], ["author", "alex"], ["created_at", "2018-08-21 04:24:13.548389"], ["updated_at", "2018-08-21 04:24:13.548389"]]

  def personal_center
    @articles = Post.where(author: session[:username])
---
SELECT "posts".* FROM "posts" WHERE "posts"."author" = ?  [["author", "alex"]]

  def my_comments
    @comments = Comment.where(author: session[:username])
---
SELECT "comments".* FROM "comments" WHERE "comments"."author" = ?  [["author", "admin"]]

  def my_feedbacks
    @feedbacks = Feedback.where(author: session[:username])
---
SELECT "feedbacks".* FROM "feedbacks" WHERE "feedbacks"."author" = ?  [["author", "alex"]]

  def article
    @article = Post.find(params[:id])
    session[:article_id] = params[:id]
    @comments = Comment.where(article_id: session[:article_id])
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT  "comments".* FROM "comments" WHERE "comments"."article_id" = ? LIMIT ?  [["article_id", 3], ["LIMIT", 1]]

  def write_comment
    @new_comment = Comment.new(commenter: params[:commenter], author: session[:username], article_id: session[:article_id])
    @new_comment.save
---
INSERT INTO "comments" ("commenter", "author", "article_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["commenter", "ceshi"], ["author", "alex"], ["article_id", 2], ["created_at", "2018-08-21 06:11:59.307911"], ["updated_at", "2018-08-21 06:11:59.307911"]]

  def change_password_result
    @user = User.find_by_username(session[:username])
    @return
    if @user.password == params[:old_password]
      @user.update(password: params[:new_password1])
---
SELECT  "users".* FROM "users" WHERE "users"."username" = ? LIMIT ?  [["username", "alex"], ["LIMIT", 1]]
UPDATE "users" SET "password" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["password", "qwe"], ["updated_at", "2018-08-18 13:31:34.831142"], ["id", 1]]

  def delete_article
    @article = Post.find(params[:id])
    @article.destroy

    @comments = Comment.where(article_id: session[:article_id])

    @comments.each(&:destroy)
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
DELETE FROM "posts" WHERE "posts"."id" = ?  [["id", 4]]
SELECT "comments".* FROM "comments" WHERE "comments"."article_id" = ?  [["article_id", 7]]
SELECT  "comments".* FROM "comments" WHERE "comments"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]

  def delete_comment
    @comment = Comment.find(params[:id])
    @comment.destroy
---
SELECT  "comments".* FROM "comments" WHERE "comments"."id" = ? LIMIT ?  [["id", 16], ["LIMIT", 1]]
DELETE FROM "comments" WHERE "comments"."id" = ?  [["id", 16]]